<details><summary>Digger run report at 2024-03-03 17:06:54 (UTC)</summary>
      <details><summary>Plan for <b>diggerhq/demo-terragrunt-parallel#prod-svc-messaging</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example will be destroyed
  # (because aws_s3_bucket.example is not in configuration)
  - resource "aws_s3_bucket" "example" {
      - arn                         = "arn:aws:s3:::demo-terragrunt-parallel-svc-messaging-prod" -> null
      - bucket                      = "demo-terragrunt-parallel-svc-messaging-prod" -> null
      - bucket_domain_name          = "demo-terragrunt-parallel-svc-messaging-prod.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "demo-terragrunt-parallel-svc-messaging-prod.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "demo-terragrunt-parallel-svc-messaging-prod" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "48ca234ec08b854fd7875d07ed50011a403a0297310717063d53e2085019f22f" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.iam_role.aws_iam_policy.example_policy will be created
  + resource "aws_iam_policy" "example_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "s3_bucket_role_messaging-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam_role.aws_iam_role.example_role will be created
  + resource "aws_iam_role" "example_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "s3_bucket_role_messaging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_role.aws_iam_role_policy_attachment.example_attach will be created
  + resource "aws_iam_role_policy_attachment" "example_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "s3_bucket_role_messaging"
    }

  # module.s3_bucket.aws_s3_bucket.example_bucket will be created
  + resource "aws_s3_bucket" "example_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "demo-terragrunt-parallel-svc-messaging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_policy.example_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "example_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

  ```
</details>

<details><summary>Plan for <b>diggerhq/demo-terragrunt-parallel#prod-svc-identity</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example will be destroyed
  # (because aws_s3_bucket.example is not in configuration)
  - resource "aws_s3_bucket" "example" {
      - arn                         = "arn:aws:s3:::demo-terragrunt-parallel-svc-identity-prod" -> null
      - bucket                      = "demo-terragrunt-parallel-svc-identity-prod" -> null
      - bucket_domain_name          = "demo-terragrunt-parallel-svc-identity-prod.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "demo-terragrunt-parallel-svc-identity-prod.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "demo-terragrunt-parallel-svc-identity-prod" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "48ca234ec08b854fd7875d07ed50011a403a0297310717063d53e2085019f22f" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.iam_role.aws_iam_policy.example_policy will be created
  + resource "aws_iam_policy" "example_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "s3_bucket_role_identity-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam_role.aws_iam_role.example_role will be created
  + resource "aws_iam_role" "example_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "s3_bucket_role_identity"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_role.aws_iam_role_policy_attachment.example_attach will be created
  + resource "aws_iam_role_policy_attachment" "example_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "s3_bucket_role_identity"
    }

  # module.s3_bucket.aws_s3_bucket.example_bucket will be created
  + resource "aws_s3_bucket" "example_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "demo-terragrunt-parallel-svc-identity"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_policy.example_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "example_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

  ```
</details>


<details><summary>Terraform plan validation check (prod-svc-messaging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>